[
  {
    "id": 1,
    "question": "Что такое фишинг?",
    "options": [
      "Вид вредоносного программного обеспечения",
      "Метод социальной инженерии, направленный на получение конфиденциальной информации",
      "Тип сетевой атаки, направленной на перегрузку сервера",
      "Способ шифрования данных"
    ],
    "correct_answer": 1
  },
  {
    "id": 2,
    "question": "Какой из перечисленных паролей является наиболее надежным?",
    "options": [
      "123456",
      "password",
      "qwerty",
      "P@$$wOrd123"
    ],
    "correct_answer": 3
  },
  {
    "id": 3,
    "question": "Что такое двухфакторная аутентификация?",
    "options": [
      "Использование двух разных паролей для одного аккаунта",
      "Метод подтверждения личности пользователя с использованием двух разных факторов",
      "Способ шифрования данных с использованием двух ключей",
      "Тип биометрической аутентификации"
    ],
    "correct_answer": 1
  },
    {
    "id": 4,
    "question": "Какой из следующих вариантов НЕ является примером вредоносного ПО?",
    "options": [
      "Вирус",
      "Червь",
      "Троянский конь",
      "Файрвол"
    ],
    "correct_answer": 3
  },
    {
    "id": 5,
    "question": "Что такое DDoS-атака?",
    "options": [
      "Атака, направленная на получение доступа к конфиденциальным данным",
      "Атака, направленная на отказ в обслуживании путем перегрузки сервера",
      "Атака, использующая уязвимости в программном обеспечении",
      "Атака, направленная на кражу паролей"
    ],
    "correct_answer": 1
  }
]
